---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.MainEngagementParameterError
source: html/d23c0c68-b464-b9d3-4385-833edd687207.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.MainEngagementParameterError Property

This is used to post error. "Bar Engagement 1" has an incorrect value.

## Syntax (C#)
```csharp
public static FailureDefinitionId MainEngagementParameterError { get; }
```